Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# AboutMid
source: Returns the characters from the middle of a text value, given a starting position and length.
bg_bg: Връща знаците от средата на дадена текстова стойност на база определена начална позиция и дължина.
ca_es: Retorna els caràcters del mig d'un valor de text a partir de la posició inicial i la longitud.
cs_cz: Vrátí znaky ze střední části textové hodnoty, od zadané počáteční pozice a se zadanou délkou.
da_dk: Returnerer tegnene fra midten af en tekstværdi med en startposition og længde.
de_de: Gibt die Zeichen aus der Mitte eines Textwerts zurück, bei angegebener Anfangsposition und Länge.
el_gr: Επιστρέφει τους χαρακτήρες από τη μέση μιας τιμής κειμένου, με δεδομένη μια θέση έναρξης και το μήκος.
es_es: Devuelve los caracteres desde la mitad de un valor de texto, a partir de una longitud y una posición iniciales.
et_ee: Tagastab tekstväärtuse keskelt märgid, kui määratud on alguspunkt ja pikkus.
eu_es: Testu-balio baten erdian dauden karaktereak itzultzen ditu, hasierako posizio eta luzera jakin bat kontuan hartuta.
fi_fi: Palauttaa merkit tekstiarvon keskeltä, kun määritetään alkamiskohta ja pituus.
fr_fr: Retourne les caractères du milieu d’une valeur de texte, pour une position de départ et une longueur données.
gl_es: Devolve os caracteres do centro dun valor de texto, a partir da lonxitude e da posición inicial.
hi_in: किसी पाठ मान के बीच से वर्णों को लौटाता है, बशर्ते प्रारंभिक स्थिति और लंबाई दी गई हो.
hr_hr: Vraća znakove iz sredine tekstne vrijednosti, uz zadani početni položaj i duljinu.
hu_hu: Egy szöveges karakterlánc közepéről adja vissza a megadott pozíciótól kezdve a megadott számú karaktert.
it_it: Restituisce i caratteri dal centro di un valore di testo in base a una posizione e a una lunghezza iniziali.
ja_jp: 開始位置と長さを指定して、テキスト値の途中の文字を返します。
kk_kz: Бастапқы орын мен ұзындық берілсе, таңбаларды мәтіндік мәннің ортасынан қайтарады.
ko_kr: 시작 위치 및 길이를 고려해볼 때 텍스트 값의 중간에 있는 문자를 반환합니다.
lt_lt: Pateikia simbolius iš teksto reikšmės vidurio, nurodžius pradinę padėtį ir ilgį.
lv_lv: Atgriež rakstzīmes no teksta vērtības vidus, ja ir norādīta sākuma pozīcija un garums.
ms_my: Mengembalikan aksara daripada bahagian tengah nilai teks, diberikan kedudukan dan panjang permulaan.
nb_no: Returnerer tegnene fra midten av en tekstverdi, når en startposisjon og -lengde er angitt.
nl_nl: Hiermee worden de tekens uit het midden van een tekstwaarde geretourneerd op basis van de beginpositie en lengte.
pl_pl: Zwraca znaki ze środka wartości tekstowej w oparciu o podaną pozycję początkową i długość.
pt_br: Retorna os caracteres do meio de um valor de texto a partir de uma posição inicial e um comprimento determinados.
pt_pt: Devolve os carateres a partir do meio de um valor de texto, dado determinada posição e comprimento de início.
ro_ro: Returnează caracterele din mijlocul unei valori text, ținând cont de o poziție de început și de o lungime.
ru_ru: Возвращает символы в середине текстового значения по указанным начальному положению и длине.
sk_sk: Vráti znaky zo stredu textovej hodnoty po zadaní začiatočnej pozície a dĺžky.
sl_si: Vrne znake od sredine besedilne vrednosti, ob danem začetnem položaju in dolžini.
sr_cyrl_rs: Враћа знакове из средине вредности текста, с обзиром на почетну позицију и дужину.
sr_latn_rs: Vraća znakove iz sredine vrednosti teksta, s obzirom na početnu poziciju i dužinu.
sv_se: Returnerar tecknen från mitten av ett textvärde, med en given startposition och längd.
th_th: ส่งกลับอักขระที่อยู่กึ่งกลางของข้อความ โดยกำหนดตำแหน่งเริ่มต้นและความยาว
tr_tr: Bir metin değerinin ortasından, başlangıç konumu ve uzunluğu belirtilen karakter dizisini döndürür.
uk_ua: Повертає символи із середини текстового значення з урахуванням початкового положення та довжини.
vi_vn: Trả về các ký tự từ giữa giá trị văn bản, cung cấp vị trí bắt đầu và độ dài.
zh_cn: 在提供开始位置和长度的情况下，从文本值中间返回字符。
zh_tw: 根據指定的起始位置與長度，從文字值的中間開始傳回字元。

# AboutMidT
source: Returns the characters from the middle of a text value, given a starting position and length, evaluated per row within the specified table or collection.
bg_bg: Връща знаците от средата на дадена текстова стойност на база определена начална позиция и дължина, изчислена на ред в указаната таблица или колекция.
ca_es: Retorna els caràcters del mig d'un valor de text, a partir de la posició inicial i la longitud, avaluat per fila a la taula o col·lecció especificada.
cs_cz: Vrátí znaky ze střední části textové hodnoty, od zadané počáteční pozice a se zadanou délkou. Vyhodnocuje se pro každý řádek v zadané tabulce nebo kolekci.
da_dk: Returnerer tegnene fra midten af en tekstværdi med en startposition og længde, som evalueres pr. række i den angivne tabel eller samling.
de_de: Gibt die Zeichen aus der Mitte eines Textwerts zurück, bei angegebener Anfangsposition und Länge, bei Auswertung pro Zeile in der angegebenen Tabelle oder Sammlung.
el_gr: Επιστρέφει τους χαρακτήρες από τη μέση μιας τιμής κειμένου, με δεδομένη μια θέση έναρξης και το μήκος, με αξιολόγηση ανά σειρά εντός του καθορισμένου πίνακα ή της καθορισμένης συλλογής.
es_es: Devuelve los caracteres desde la mitad de un valor de texto, a partir de una longitud y una posición iniciales, evaluado por fila dentro de la tabla o colección especificada.
et_ee: Tagastab tekstväärtuse keskelt märgid, kui määratud on alguspunkt ja pikkus, arvutatakse määratud tabelis või kogumis ridade kaupa.
eu_es: Zehaztutako taulan edo bilduman errenkadako ebaluatuko den testu-balioaren erdian dauden karaktereak itzultzen ditu, hasierako posizio eta luzera jakin bat kontuan hartuta.
fi_fi: Palauttaa merkit tekstiarvon keskeltä, kun määritetään alkamiskohta ja pituus, arvioituna riviä kohti määritetyssä taulukossa tai kokoelmassa.
fr_fr: Retourne les caractères du milieu d’une valeur de texte, pour une position de départ et une longueur données, évaluée par ligne dans la table ou la collection spécifiée.
gl_es: Devolve os caracteres do centro dun valor de texto, a partir da lonxitude e da posición inicial, avaliado por fila dentro da táboa ou colección especificadas.
hi_in: किसी पाठ मान के बीच से वर्णों को लौटाता है, बशर्ते प्रारंभिक स्थिति और लंबाई दी गई हो, जिसका मूल्यांकन निर्दिष्ट तालिका या संग्रह की प्रत्येक पंक्ति पर किया गया हो.
hr_hr: Vraća znakove iz sredine tekstne vrijednosti, uz zadani početni položaj i duljinu, vrednovano po retku unutar određene tablice ili zbirke.
hu_hu: Egy szöveges karakterlánc közepéről adja vissza a megadott pozíciótól kezdve a megadott számú karaktert, a bemeneti tábla vagy gyűjtemény minden sorából.
it_it: Restituisce i caratteri dal centro di un valore di testo in base a una posizione e a una lunghezza iniziali, valutati per riga all'interno della tabella o della raccolta specificata.
ja_jp: 開始位置と長さを指定して、テキスト値の途中の文字を返します。指定のテーブルまたはコレクション内の行ごとに評価されます。
kk_kz: Көрсетілген кестеде немесе жиынтықта әр жол үшін есептелетін, бастапқы орын мен ұзындық берілсе, таңбаларды мәтіндік мәннің ортасынан қайтарады.
ko_kr: 시작 위치 및 길이를 고려해볼 때 지정된 테이블이나 컬렉션 내 행당 평가되는 텍스트 값의 중간에 있는 문자를 반환합니다.
lt_lt: Pateikia simbolius iš teksto reikšmės vidurio, pateikus pradžios padėtį ir ilgį; apskaičiuotus po eilutė nurodytoje lentelėje ar rinkinyje.
lv_lv: Atgriež rakstzīmes no teksta vērtības vidus, ja ir norādīta sākuma pozīcija un garums, kas novērtētas katrai rindai norādītajā tabulā vai kolekcijā.
ms_my: Mengembalikan aksara daripada bahagian tengah nilai teks, diberikan kedudukan dan panjang permulaan yang dinilai bagi setiap baris dalam jadual atau koleksi yang ditentukan.
nb_no: Returnerer tegnene fra midten av en tekstverdi, når en startposisjon og -lengde er angitt, som er evaluert per rad i den angitte tabellen eller samlingen.
nl_nl: Hiermee worden de tekens uit het midden van een tekstwaarde geretourneerd op basis van de beginpositie en lengte, geëvalueerd per rij in de opgegeven tabel of verzameling.
pl_pl: Zwraca znaki ze środka wartości tekstowej w oparciu o podaną pozycję początkową i długość. Funkcja jest oceniana dla każdego wiersza w określonej tabeli lub kolekcji.
pt_br: Retorna os caracteres do meio de um valor de texto a partir de uma posição inicial e um comprimento determinados, avaliados por linha dentro da tabela ou coleção especificada.
pt_pt: Devolve os carateres a partir do meio de um valor de texto, dado determinada posição e comprimento de início, avaliados por linha dentro da tabela ou coleção especificada.
ro_ro: Returnează caracterele din mijlocul unei valori text, ținând cont de o poziție de început și de o lungime, evaluate după fiecare rând din tabelul sau colecția specificate.
ru_ru: Возвращает символы в середине текстового значения по указанным начальному положению и длине для каждой строки в указанной таблице или коллекции.
sk_sk: Po zadaní začiatočnej pozície a dĺžky vráti znaky zo stredu textovej hodnoty vyhodnotenej pre riadok v zadanej tabuľke alebo kolekcii.
sl_si: Vrne znake od sredine besedilne vrednosti, in sicer ob navedenem začetnem položaju in dolžini, pri čemer ovrednoti vsako vrstico določene tabele ali zbirke.
sr_cyrl_rs: Враћа знакове из средине вредности текста, с обзиром на почетну позицију и дужину, процењене по реду у оквиру наведене табеле или колекције.
sr_latn_rs: Vraća znakove iz sredine vrednosti teksta, s obzirom na početnu poziciju i dužinu, procenjene po redu u okviru navedene tabele ili kolekcije.
sv_se: Returnerar tecknen från mitten av ett textvärde, med en given startposition och längd, som utvärderas per rad inom den angivna tabellen eller samlingen.
th_th: ส่งกลับอักขระที่อยู่กึ่งกลางของข้อความ โดยกำหนดตำแหน่งเริ่มต้นและความยาว และประเมินทีละแถวภายในตารางหรือคอลเลกชันที่ระบุ
tr_tr: Belirtilen tablo veya koleksiyonda her satır için değerlendirilen bir metin değerinin ortasından, başlangıç konumu ve uzunluğu belirtilen karakter dizisini döndürür.
uk_ua: Повертає символи із середини текстового значення, яке визначається для кожного рядка в межах указаної таблиці або колекції, з урахуванням початкового положення та довжини.
vi_vn: Trả về các ký tự ở khoảng giữa giá trị văn bản, cung cấp vị trí bắt đầu và độ dài, được đánh giá theo hàng trong bảng hoặc bộ sưu tập được chỉ định.
zh_cn: 在提供开始位置和长度的情况下，从对指定表或集合中每行计算的文本值中间返回字符。
zh_tw: 對指定資料表或集合中的每個資料列進行評估，根據指定的起始位置與長度，從文字值的中間開始傳回字元。

# AboutMid_text
source: A text value from which characters will be extracted.
bg_bg: Текстова стойност, от която ще се извлекат знаците.
ca_es: Valor de text del qual s'extrauran caràcters.
cs_cz: Textová hodnota, ze které se budou extrahovat znaky
da_dk: En tekstværdi, hvorfra tegnene skal udtrækkes.
de_de: Ein Textwert, aus dem Zeichen extrahiert werden.
el_gr: Μια τιμή κειμένου από την οποία θα γίνεται εξαγωγή χαρακτήρων.
es_es: Un valor de texto del que se extraerán caracteres.
et_ee: Tekstväärtus, kust märgid ekstraktitakse.
eu_es: Testu-balioa, nondik karaktereak aterako diren.
fi_fi: Tekstiarvo, josta merkit poimitaan.
fr_fr: Valeur de texte dont des caractères seront extraits.
gl_es: Valor de texto do que se van extraer caracteres.
hi_in: एक पाठ मान जिससे वर्ण निकाले जाएँगे.
hr_hr: Tekstna vrijednost iz koje će se znakovi izdvojiti.
hu_hu: Az a szöveges érték, amelyből ki kell nyerni a karaktereket.
it_it: Valore di testo da cui verranno estratti i caratteri.
ja_jp: 文字の抽出元であるテキスト値。
kk_kz: Таңбалар алынатын мәтіндік мән.
ko_kr: 문자가 추출되는 텍스트 값입니다.
lt_lt: Tekstinė reikšmė, iš kurios bus išgauti simboliai.
lv_lv: Teksta vērtība, no kuras rakstzīmes tiks izgūtas.
ms_my: Nilai teks yang aksaranya akan diekstrak.
nb_no: En tekstverdi som tegn blir trukket ut fra.
nl_nl: Een tekstwaarde waaruit tekens worden geëxtraheerd.
pl_pl: Wartość tekstowa, z której będą wyodrębniane znaki.
pt_br: Valor de texto do qual os caracteres serão extraídos.
pt_pt: Um valor de texto a partir do qual os carateres serão extraídos.
ro_ro: O valoare text din care vor fi extrase caractere.
ru_ru: Текстовое значение, из которого будут извлечены символы.
sk_sk: Textová hodnota, z ktorej sa vyextrahujú znaky.
sl_si: Besedilna vrednost, iz katere bodo izvlečeni znaki.
sr_cyrl_rs: Вредност текста из које ће знакови бити издвојени.
sr_latn_rs: Vrednost teksta iz koje će znakovi biti izdvojeni.
sv_se: Textvärdet som tecknen ska extraheras från.
th_th: ข้อความที่จะแยกอักขระออกมา
tr_tr: Karakterlerin ayıklanacağı bir metin değeri.
uk_ua: Текстове значення, звідки видобуватимуться символи.
vi_vn: Một giá trị văn bản mà trong đó, các ký tự sẽ được trích xuất.
zh_cn: 将从中提取字符的文本值。
zh_tw: 擷取其字元的文字值。

# AboutMid_text_column
source: A column of text values from which characters will be extracted into a new column.
bg_bg: Колона с текстови стойности, от която ще се извлекат знаците в нова колона.
ca_es: Columna de valors de text de la qual s'extrauran caràcters a una columna nova.
cs_cz: Sloupec textových hodnot, ze kterého se budou extrahovat znaky do nového sloupce
da_dk: En kolonne med tekstværdier, hvorfra tegnene skal trækkes ind i en ny kolonne.
de_de: Eine Spalte mit Textwerten, aus denen Zeichen in eine neue Spalte extrahiert werden sollen.
el_gr: Μια στήλη τιμών κειμένου από τις οποίες οι χαρακτήρες θα εξάγονται σε μια νέα στήλη.
es_es: Una columna de valores de texto de la que se extraerán caracteres en una columna nueva.
et_ee: Tekstväärtuste veerg, millest märgid uude veergu ekstraktitakse.
eu_es: Zutabe berri batera aterako diren karaktereak dituen testu-balioen zutabea.
fi_fi: Tekstiarvojen sarake, jonka merkit poimitaan uuteen sarakkeeseen.
fr_fr: Colonne de valeurs de texte dont des caractères seront extraits dans une nouvelle colonne.
gl_es: Columna de valores de texto da que se extraerán caracteres nunha nova columna.
hi_in: पाठ मानों का एक स्तंभ जिससे वर्णों को किसी नए स्तंभ में निकाला जाएगा.
hr_hr: Stupac tekstne vrijednosti iz kojeg će se znakovi izdvojiti u novi stupac.
hu_hu: Az azokat a szöveges értékeket tartalmazó oszlop, amelyből a függvény egy új oszlopba fogja kinyerni a karaktereket.
it_it: Colonna di valori di testo da cui verranno estratti i caratteri in una nuova colonna.
ja_jp: 新しい列に文字を抽出する際の抽出元となるテキスト値の列。
kk_kz: Жаңа баған үшін таңбалар алынатын мәтіндік мәндер бағаны.
ko_kr: 문자가 새 열로 추출되는 텍스트 값 열입니다.
lt_lt: Teksto reikšmių stulpelis, iš kurio bus išgauti simboliai į naują stulpelį.
lv_lv: Teksta vērtību kolonna, no kuras rakstzīmes tiks izgūtas jaunā kolonnā.
ms_my: Lajur nilai teks yang aksaranya akan diekstrak ke dalam lajur baru.
nb_no: En kolonne med tekstverdier som tegn blir trukket ut fra til en ny kolonne.
nl_nl: Een kolom met tekstwaarden waaruit tekens worden geëxtraheerd naar een nieuwe kolom.
pl_pl: Kolumna wartości tekstowych, z której znaki będą wyodrębniane do nowej kolumny.
pt_br: Coluna de valores de texto da qual os caracteres serão extraídos para uma nova coluna.
pt_pt: Uma coluna de valores de texto a partir da qual os carateres serão extraídos para uma nova coluna.
ro_ro: O coloană de valori text din care vor fi extrase caracterele într-o nouă coloană.
ru_ru: Столбец текстовых значений, символы из которых будут извлечены в новый столбец.
sk_sk: Stĺpec textových hodnôt, z ktorých sa vyextrahujú znaky do nového stĺpca.
sl_si: Stolpec besedilnih vrednosti, iz katerih bodo izvlečeni znaki v nov stolpec.
sr_cyrl_rs: Колона са вредностима текста из које ће знакови бити издвојени у нову колону.
sr_latn_rs: Kolona sa vrednostima teksta iz koje će znakovi biti izdvojeni u novu kolonu.
sv_se: En kolumn med textvärden från vilken teknen kommer att extraheras till en ny kolumn.
th_th: คอลัมน์ของข้อความที่จะถูกแยกอักขระออกมาให้เป็นคอลัมน์ใหม่
tr_tr: Karakterleri yeni bir sütuna ayıklanacak olan bir metin değeri sütunu.
uk_ua: Стовпець із текстовими значеннями, звідки потрібно видобути символи в новий стовпець.
vi_vn: Một cột chứa các giá trị văn bản, trong đó các ký tự sẽ được trích xuất vào một cột mới.
zh_cn: 将其中字符提取到新列中的文本值组成的列。
zh_tw: 將擷取其字元到新的資料行之文字值資料行。

# AboutMid_start_num
source: The start position where to extract characters from.
bg_bg: Началната позиция, от която да се извлекат знаците.
ca_es: Posició d'inici d'on s'extrauran caràcters.
cs_cz: Počáteční pozice, od které se mají znaky extrahovat
da_dk: Startpositionen, hvorfra tegnene udtrækkes.
de_de: Die Anfangsposition, ab der Zeichen extrahiert werden sollen.
el_gr: Η θέση έναρξης από την οποία θα γίνεται η εξαγωγή χαρακτήρων.
es_es: Posición inicial desde la que se van a extraer caracteres.
et_ee: Alguspunkt, millest alates märgid ekstraktitakse.
eu_es: Karaktereak ateratzeko erabiliko den hasierako posizioa.
fi_fi: Alkamiskohta, josta merkit poimitaan.
fr_fr: Position de départ à partir de laquelle extraire des caractères.
gl_es: Posición inicial desde a que extraer os caracteres.
hi_in: वह प्रारंभ स्थिति जहाँ से वर्ण निकाले जाएँगे.
hr_hr: Početni položaj od kojeg se izdvajaju znakovi.
hu_hu: Az a pozíció, amelytől kezdve ki kell nyerni a karaktereket.
it_it: Posizione iniziale da cui estrarre i caratteri.
ja_jp: 文字抽出の開始位置。
kk_kz: Таңбалар алынатын бастапқы орын.
ko_kr: 문자를 추출할 시작 위치입니다.
lt_lt: Pradžios padėtis, iš kur reikia išgauti simbolius.
lv_lv: Sākuma pozīcija, no kuras izgūt rakstzīmes.
ms_my: Kedudukan mula lokasi aksara diekstrak.
nb_no: Startposisjonen som tegnene skal trekkes ut fra.
nl_nl: De beginpositie waaruit tekens moeten worden geëxtraheerd.
pl_pl: Pozycja początkowa, od której będą wyodrębniane znaki.
pt_br: Posição inicial para a extração de caracteres.
pt_pt: Posição inicial de onde extrair os carateres.
ro_ro: Poziția de început de la care să fie extrase caracterele.
ru_ru: Начальная позиция для извлечения символов.
sk_sk: Počiatočná pozícia, z ktorej sa vyextrahujú znaky.
sl_si: Začetni položaj, od katere je treba izvleči znake.
sr_cyrl_rs: Почети положај са којег треба издвојити знакове.
sr_latn_rs: Početi položaj sa kojeg treba izdvojiti znakove.
sv_se: Startpositionen som tecken ska extraheras från.
th_th: ตำแหน่งเริ่มต้นที่จะแยกอักขระออกมา
tr_tr: Karakterlerin ayıklanacağı başlangıç konumu.
uk_ua: Початкове положення для видобування символів.
vi_vn: Vị trí bắt đầu ở nơi trích xuất các ký tự.
zh_cn: 要提取字符的开始位置。
zh_tw: 擷取字元的起始位置。

# AboutMid_num_chars
source: The number of characters to extract.
bg_bg: Броят знаци за извличане.
ca_es: Nombre de caràcters que s'extraurà.
cs_cz: Počet znaků, které se mají extrahovat
da_dk: Antallet af tegn, der skal trækkes ud.
de_de: Die Anzahl der zu extrahierenden Zeichen.
el_gr: Ο αριθμός των χαρακτήρων για εξαγωγή.
es_es: Número de caracteres que se va a extraer.
et_ee: Ekstraktitavate märkide arv.
eu_es: Aterako den karaktere kopurua.
fi_fi: Poimittavien merkkien määrä.
fr_fr: Nombre de caractères à extraire.
gl_es: Número de caracteres que se van extraer.
hi_in: निकाले जाने वाले वर्णों की संख्या.
hr_hr: Broj znakova koji se izdvajaju.
hu_hu: A kinyerendő karakterek száma.
it_it: Numero di caratteri da estrarre.
ja_jp: 抽出する文字数。
kk_kz: Шығарылатын таңбалар саны.
ko_kr: 추출할 문자 수입니다.
lt_lt: Simbolių skaičius, kurį reikia išgauti.
lv_lv: Izgūstamo rakstzīmju skaits.
ms_my: Bilangan aksara untuk diekstrak.
nb_no: Antall tegn som skal trekkes ut.
nl_nl: Het aantal tekens dat moet worden geëxtraheerd.
pl_pl: Liczba znaków do wyodrębnienia.
pt_br: Número de caracteres a extrair.
pt_pt: O número de carateres para extrair.
ro_ro: Numărul de caractere de extras.
ru_ru: Количество символов для извлечения.
sk_sk: Počet znakov na vyextrahovanie.
sl_si: Število znakov, ki jih je treba izvleči.
sr_cyrl_rs: Број знакова за издвајање.
sr_latn_rs: Broj znakova za izdvajanje.
sv_se: Antal tecken att extrahera.
th_th: จำนวนตัวอักษรที่จะแยกออกมา
tr_tr: Ayıklanacak karakter sayısı.
uk_ua: Кількість символів, яку потрібно видобути.
vi_vn: Số ký tự cần trích xuất.
zh_cn: 要提取的字符数。
zh_tw: 要擷取的字元數。

# StringFuncArg1
source: text
bg_bg: текст
da_dk: tekst
el_gr: κείμενο
es_es: texto
et_ee: tekst
eu_es: testua
fi_fi: teksti
fr_fr: texte
gl_es: texto
hi_in: पाठ
hr_hr: tekst
hu_hu: szöveg
it_it: testo
ja_jp: テキスト
kk_kz: мәтін
ko_kr: 텍스트
lt_lt: tekstas
lv_lv: teksts
ms_my: teks
nb_no: tekst
nl_nl: tekst
pl_pl: tekst
pt_br: texto
pt_pt: texto
ru_ru: текст
sl_si: besedilo
sr_cyrl_rs: текст
sr_latn_rs: tekst
th_th: ข้อความ
tr_tr: metin
uk_ua: текст
vi_vn: văn_bản
zh_cn: 文本
zh_tw: 文字

# StringTFuncArg1
source: text_column
bg_bg: текстова_колона
ca_es: columna_text
cs_cz: sloupec_textu
da_dk: tekst_kolonne
de_de: Textspalte
el_gr: στήλη_κειμένου
es_es: columna_texto
et_ee: tekstiveerg
eu_es: testu_zutabea
fi_fi: tekstisarake
fr_fr: colonne_texte
gl_es: columna_texto
hi_in: पाठ_स्तंभ
hr_hr: tekstni_stupac
hu_hu: szöveg_oszlopa
it_it: colonna_testo
ja_jp: テキスト_列
kk_kz: мәтін_бағаны
ko_kr: 텍스트_열
lt_lt: teksto_stulpelis
lv_lv: teksta_kolonna
ms_my: lajur_teks
nb_no: tekstkolonne
nl_nl: kolom_tekst
pl_pl: kolumna_tekstu
pt_br: coluna_texto
pt_pt: coluna_texto
ro_ro: coloană_text
ru_ru: текстовый_столбец
sk_sk: textový_stĺpec
sl_si: stolpec_z_besedilom
sr_cyrl_rs: текст_колона
sr_latn_rs: tekst_kolona
sv_se: text_kolumn
th_th: คอลัมน์_ข้อความ
tr_tr: metin_sütunu
uk_ua: текстовий_стовпець
vi_vn: cột_văn_bản
zh_cn: 文本列
zh_tw: 文字_資料行

# StringFuncArg2
source: start_num
bg_bg: начална_позиция
ca_es: núm_inici
cs_cz: počáteční_číslo
de_de: Startzahl
el_gr: αριθμός_έναρξης
es_es: núm_inicial
et_ee: algusnr
eu_es: hasiera_zk
fi_fi: aloittava_luku
fr_fr: num_début
gl_es: núm_inicial
hi_in: प्रारंभिक_संख्या
hr_hr: početni_broj
hu_hu: kezdő_szám
it_it: num_inizio
ja_jp: 開始位置
kk_kz: бастапқы_орын
ko_kr: 시작_번호
lt_lt: pradinis_skaičius
lv_lv: sākuma_skaits
ms_my: nombor_mula
nb_no: startnummer
nl_nl: waarde_begin
pl_pl: liczba_początkowa
pt_br: núm_inicial
pt_pt: num_início
ro_ro: num_start
ru_ru: начальная_позиция
sk_sk: začiatočné_číslo
sl_si: številka_začetka
sr_cyrl_rs: старт_нум
sv_se: start_antal
th_th: จำนวน_เริ่มต้น
tr_tr: başlangıç_sayısı
uk_ua: початкове_число
vi_vn: số_bắt_đầu
zh_cn: 起始编号
zh_tw: 開始_數字

# StringFuncArg3
source: num_chars
bg_bg: брой_знаци
ca_es: núm_caràcters
cs_cz: počet_znaků
da_dk: num_tegn
de_de: Anzahl_Zeichen
el_gr: αριθμός_χαρακτήρων
es_es: núm_caracteres
et_ee: märkide_arv
eu_es: karaktere_kop
fi_fi: merkkien_määrä
fr_fr: nombre_car
gl_es: núm_caracteres
hi_in: वर्णो_संख्या
hr_hr: broj_znakova
hu_hu: karakterek_száma
it_it: num_caratteri
ja_jp: 文字数
kk_kz: таңбалар_саны
ko_kr: 문자_수
lt_lt: simbolių_skaičius
lv_lv: skaits_rakstzīmes
ms_my: nombor_aksara
nb_no: num_tegn
nl_nl: aantal_tekens
pl_pl: liczba_znaków
pt_br: núm_charact
pt_pt: num_carateres
ro_ro: num_car
ru_ru: количество_символов
sk_sk: počet_znakov
sl_si: število_znakov
sr_cyrl_rs: нум_знакови
sr_latn_rs: num_znakovi
sv_se: antal_tecken
th_th: จำนวน_อักขระ
tr_tr: sayı_karakterler
uk_ua: кількість_символів
vi_vn: ký_tự_số
zh_cn: 数字字符
zh_tw: 字元_數
